app/AccessControl.php

SELECT * FROM "users" WHERE "users"."id" = '1' LIMIT 1
---
	public function loadPermissions($user = null) {
		//default to the current user if one isn't provided
		if(!$user) {
			$user = \Auth::user();

			if(!$user) {
				throw new \Exception('Missing user.');
			}
		}
		$user = User::find($user['id']);