app/AccessControlStructure.php

SELECT * FROM "access_control_structure" WHERE 1 = 1 ORDER BY "parent_id" ASC
---
	public function getStructure() {
		$output = array();
		$structure = self::whereRaw('1 = 1')
				->orderBy('parent_id')
				->get();