app/Atom.php

SELECT * FROM "atoms" WHERE "id" in ('234853', '193741', '193743', '193744', '194092', '193745', '184532', '190494', '185290', '188862', '189498', '193739', '193740', '193013', '185970', '187572') and "atoms"."deleted_at" IS NULL
---

        $query = self::whereIn('id', $candidates);

        return [
            'count' => $count,
            'atoms' => $query->get()
        ];

SELECT * FROM "atoms" WHERE "entity_id" = '599c96938d1fe084243282' and "product_id" = '5' ORDER BY "id" DESC LIMIT 1
---
    public static function findNewestIfNotDeleted($entityId, $productId) {
        $atom = self::withTrashed()
                ->where('entity_id', '=', $entityId)
                ->where('product_id', '=', $productId)
                ->orderBy('id', 'desc')
                ->first();