app/Comment.php

SELECT "comments".* FROM "comments" inner join "atoms" on "comments"."atom_entity_id" = "atoms"."entity_id" WHERE "atom_entity_id" in ('57b743596a41e726096824', '57b7435665acb075679771', '57b7435977af7422037938', '57b74356b0f24728161186', '57b74356b27a9140113058', '57b743602582a420140661', '57b74356c4742435054576', '57b74356c5278197332109', '57b74356c80c5907712170') and "product_id" = '1' and "comments"."deleted_at" IS NULL GROUP BY "comments"."id" ORDER BY "comments"."id" ASC
---
    protected static function getByAtomEntityId($entityId, $productId) {
        $comments = self::select('comments.*');
        if(is_array($entityId)) {
            $comments->whereIn('atom_entity_id', $entityId);
        }
        else {
            $comments->where('atom_entity_id', '=', $entityId);
        }

        $comments = $comments->join('atoms', 'comments.atom_entity_id', '=', 'atoms.entity_id')
                ->where('product_id', '=', $productId)
                ->groupBy('comments.id')
                ->orderBy('comments.id')
                ->get()
                ->toArray();