app/User.php

SELECT * FROM "user_products" WHERE "user_products"."user_id" = '504' and "user_products"."user_id" IS not NULL
---
    public static function get($id, $productId) {
        $userProductTest = self::join('user_products', 'users.id', '=', 'user_products.user_id')
                ->where('users.id', '=', $id)
                ->where('user_products.product_id', '=', $productId)
                ->first();

        if(!$userProductTest) {
            return null;
        }

        $user = self::find($id);

SELECT * FROM "user_products" WHERE "user_products"."user_id" = '1' and "user_products"."user_id" IS not NULL
---
    public static function publicList($productId) {
        $output = [];

        $userIds = self::join('user_products', 'users.id', '=', 'user_products.user_id')
                ->where('user_products.product_id', '=', $productId)
                ->pluck('user_id')
                ->toArray();

        $users = self::whereIn('id', $userIds)->get();