app/User.php

    public static function publicList() {
        $output = [];

        $users = self::select()->get();
---
SELECT * FROM "users"

    public function getPermissions() {
		$userProducts = $this->userProducts;
        $productIds = $userProducts->pluck('product_id')->all();

        //ORMs make everything so easy!
        $query = AccessControl::select();
        foreach($userProducts as $key => $userProduct) {
            $subQueryFunction = function ($subQuery) use ($userProduct) {
                $subQuery->where('product_id', '=', $userProduct->product_id)
                        ->where(function ($subQuery) use ($userProduct) {
                            $subQuery->where('user_id', '=', $userProduct->user_id)
                                    ->orWhere('group_id', '=', $userProduct->group_id);
                        });
            };

            if($key) {
                $query->orWhere($subQueryFunction);
            }
            else {
                $query->where($subQueryFunction);
            }
        }

        return $query->get();
---
SELECT * FROM "access_controls" WHERE ("product_id" = '1' and ("user_id" = '1' or "group_id" = '5')) or ("product_id" = '2' and ("user_id" = '1' or "group_id" = '11')) or ("product_id" = '3' and ("user_id" = '1' or "group_id" = '17')) or ("product_id" = '5' and ("user_id" = '1' or "group_id" = '229')) or ("product_id" = '4' and ("user_id" = '1' or "group_id" = '20')) or ("product_id" = '8' and ("user_id" = '1' or "group_id" = '807')) or ("product_id" = '7' and ("user_id" = '1' or "group_id" = '407')) or ("product_id" = '6' and ("user_id" = '1' or "group_id" = '307'))