app/Http/Controllers/LookupController.php

    public function listAction() {
        return new ApiPayload([
            'groups' => Group::allForCurrentProduct()->get(),
            'boilerplates' => Boilerplate::allForCurrentProduct()->get(),
            'tasks' => Task::allForCurrentProduct()->orderBy('sort')->orderBy('id')->get(),
            'statuses' => Status::allForCurrentProduct()->orderBy('id')->get(),
            'domains' => Domain::allForCurrentProduct()->orderBy('title', 'ASC')->get(),
            'imageStatuses' => array(
                array(
                    'id' => 1,
                    'code' => 'implemented',
                    'title' => 'Implemented',
                ),
                array(
                    'id' => 2,
                    'code' => 'accept',
                    'title' => 'Accepted'
                ),
                array(
                    'id' => 3,
                    'code' => 'pending',
                    'title' => 'Pending'
                ),
---
SELECT * FROM "domains" WHERE "product_id" = '5' and "domains"."deleted_at" IS NULL ORDER BY "id" ASC
SELECT * FROM "groups" WHERE "product_id" = '5'
SELECT * FROM "boilerplates" WHERE "product_id" = '5'
SELECT * FROM "tasks" WHERE "product_id" = '5' ORDER BY "sort" ASC, "id" ASC
SELECT * FROM "statuses" WHERE "product_id" = '5' ORDER BY "id" ASC