app/Http/Controllers/MoleculeController.php

SELECT * FROM "molecules" WHERE "product_id" = '5' and "molecules"."deleted_at" IS NULL ORDER BY "sort" ASC
---
    public function listAction($productId) {
        $molecules = Molecule::where('product_id', '=', $productId)
                ->orderBy('sort', 'ASC')
                ->get();