app/Http/Controllers/ProductController.php

    public function listAction() {
        return new ApiPayload(Product::all());
---
SELECT * FROM "products"